<a href="https://colab.research.google.com/github/stephenfrein/py_packages_data_analysis/blob/master/python_packages_data_analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Useful Python Packages for Data Analysis

This is a Jupyter notebook running in Google's Colab environment that we will use to learn about some Python packages that are useful for data analysis.

You can write and execute your Python code right in the browser here. No additional setup is required.

The main packages we will cover today are *pandas* (used for manipulating tabular data) and *matplotlib* (used to create graphs).

# Pandas

The pandas library is essential for data analysis in Python. It allows you to maniulate tabular data structures, such as you would find in a relational database or spreadsheet.

Some things we'll do with pandas:
*   Load data
*   Describe that data
*   Reshape the data

# Load Data

Let's get some data first. We can load data from a variety of formats, including:
*   text files (CSV, fixed-width)
*   JSON
*   HTML
*   MS Excel
*   SQL
... and lots of others as well.

We can also pull data from a filesystem (just give the path) or a URL.

To get things started, we'll load some CSV data about the Titanic from a URL.

In [0]:
# it's conventional to alias pandas as pd once imported
import pandas as pd
url="https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv"
# pandas will read this data into a DataFrame, the typical pandas data structure
# df is a common abbreviation used in DataFrame variables 
titanic_df=pd.read_csv(url)

# Explore Our Data

Now that we've loaded our data, let's take a look at it.

In [0]:
# let's see the first rows
titanic_df.head(n=10)
# can also do tail()

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         0       3  ...                       0   7.2500
1         1       1  ...                       0  71.2833
2         1       3  ...                       0   7.9250
3         1       1  ...                       0  53.1000
4         0       3  ...                       0   8.0500
5         0       3  ...                       0   8.4583
6         0       1  ...                       0  51.8625
7         0       3  ...                       1  21.0750
8         1       3  ...                       2  11.1333
9         1       2  ...                       0  30.0708

[10 rows x 8 columns]

In [0]:
# let's see some stats about the overall data set
titanic_df.describe()

         Survived      Pclass  ...  Parents/Children Aboard       Fare
count  887.000000  887.000000  ...               887.000000  887.00000
mean     0.385569    2.305524  ...                 0.383315   32.30542
std      0.487004    0.836662  ...                 0.807466   49.78204
min      0.000000    1.000000  ...                 0.000000    0.00000
25%      0.000000    2.000000  ...                 0.000000    7.92500
50%      0.000000    3.000000  ...                 0.000000   14.45420
75%      1.000000    3.000000  ...                 0.000000   31.13750
max      1.000000    3.000000  ...                 6.000000  512.32920

[8 rows x 6 columns]

In [0]:
# wait a minute - that only gave us the numerics
titanic_df.describe(include="all")

          Survived      Pclass  ... Parents/Children Aboard       Fare
count   887.000000  887.000000  ...              887.000000  887.00000
unique         NaN         NaN  ...                     NaN        NaN
top            NaN         NaN  ...                     NaN        NaN
freq           NaN         NaN  ...                     NaN        NaN
mean      0.385569    2.305524  ...                0.383315   32.30542
std       0.487004    0.836662  ...                0.807466   49.78204
min       0.000000    1.000000  ...                0.000000    0.00000
25%       0.000000    2.000000  ...                0.000000    7.92500
50%       0.000000    3.000000  ...                0.000000   14.45420
75%       1.000000    3.000000  ...                0.000000   31.13750
max       1.000000    3.000000  ...                6.000000  512.32920

[11 rows x 8 columns]

# Exercise

Now you try. There is a data set of blah at URL. Go get it, and find out which bleep has the highest average blonk.

In [0]:
# write your code in here below
url="https://drive.google.com/uc?export=download&id=1mKW-hqj7NVd-ong7sae-AMOCW75oTHZD"
covid_df=pd.read_csv(url)
covid_df.head()
covid_df.describe(include="all")

              date      county  ...          cases        deaths
count        70218       70218  ...   70218.000000  70218.000000
unique          89        1647  ...            NaN           NaN
top     2020-04-18  Washington  ...            NaN           NaN
freq          2762         862  ...            NaN           NaN
mean           NaN         NaN  ...     137.243228      4.953758
std            NaN         NaN  ...    1703.652015     98.072606
min            NaN         NaN  ...       0.000000      0.000000
25%            NaN         NaN  ...       2.000000      0.000000
50%            NaN         NaN  ...       7.000000      0.000000
75%            NaN         NaN  ...      28.000000      1.000000
max            NaN         NaN  ...  131273.000000   8632.000000

[11 rows x 6 columns]